Repository: sslavik/acdat
Catalog: TMXParser/en-es.tmx
Source language: en
Languages: es

source: See also: mysql_list_tables().
es: ?php mysql_connect ("localhost:3306"); $result = mysql_list_tables ("wisconsin"); $i = 0; while ($i mysql_num_rows ($result)) {$tb_names[$i] = mysql_tablename ($result, $i); echo $tb_names[$i]. "BR"; $i++;}?

source: Example 1. mysql_thread_id() example
es: Ejemplo 1. mysql_thread_id() example

source: Example 1. natsort() example
es: Ejemplo 1. natsort() example

source: Example 1. ncurses_getmouse() example
es: Ejemplo 1. ncurses_getmouse() example

source: Example 1. ncurses_mousemask() example
es: Ejemplo 1. ncurses_mousemask() example

source: Returns the array element in the next place that 's pointed by the internal array pointer, or FALSE if there are no more elements.
es: Devuelve el elemento de la matriz que ocupa el lugar siguiente al apuntado por el puntero interno, o FALSE si no hay más elementos.

source: next() behaves like current(), with one difference.
es: next() se comporta como current(), con una diferencia.

source: It advances the internal array pointer one place forward before returning the element.
es: Avanza el puntero interno de la matriz en una posición antes de devolver el elemento.

source: That means it returns the next array element and advances the internal array pointer by one.
es: Eso significa que devuelve el siguiente elemento de la matriz y que avanza el puntero interno en uno.

source: If advancing the internal array pointer results in going beyond the end of the element list, next() returns FALSE.
es: Si al avanzar se pasa del final de la lista de elementos, next() devuelve FALSE.

source: If the array contains empty elements, or elements that have a key value of 0 then this function will return FALSE for these elements as well.
es: Si la matriz contiene elementos vacíos, esta función también devolverá FALSE para dichos elementos.

source: To properly traverse an array which may contain empty elements or elements with key values of 0 see the each() function.
es: Para recorrer adecuadamente una matriz que pueda contener elementos vacíos, vea la función each().

source: See also current(), end(), prev(), and reset().
es: Vea también: current(), end() prev() y reset()

source: Starting with PHP 4.0.5, nl2br() is now XHTML compliant.
es: Devuelve la cadena con 'BR' insertados antes de cada nueva línea.

source: See also htmlspecialchars(), htmlentities(), wordwrap(), and str_replace().
es: Vea también htmlspecialchars(), htmlentities() y wordwrap().

source: Unified ODBC functions
es: ODBC functions

source: Example 1. number_format() Example
es: Ejemplo 1. number_format() Example

source: See also ob_start(), ob_clean() and ob_end_flush().
es: See also ob_start() and ob_end_flush().

source: If you want to further process the buffer' s contents you have to call ob_get_contents() before ob_end_flush() as the buffer contents are discarded after ob_end_flush() is called.
es: If you want to further process the buffer' s contents you have to call ob_get_contents() before ob_end_flush() as the buffer contents are discarded after ob_get_contents() is called.

source: See also ob_start(), ob_get_contents(), ob_flush() and ob_end_clean().
es: See also ob_start(), ob_get_contents(), and ob_end_clean().

source: This will return the length of the contents in the output buffer or FALSE, if output buffering isn 't active.
es: This will return the length of the contents in the output buffer or FALSE, if output buffering isnt 't active.

source: Example 1. ob_gzhandler() Example
es: Ejemplo 1. ob_gzhandler() Example

source: Example 1. ob_iconv_handler() example:
es: Ejemplo 1. ob_iconv_handler() example:

source: Image functions
es: Funciones para imágenes

source: When output_callback is called, it will receive the contents of the output buffer as its parameter and is expected to return a new output buffer as a result, which will be sent to the browser.
es: While output buffering is active no output is sent from the script, instead the output is stored in an internal buffer.

source: See also ob_get_contents(), ob_end_flush(), ob_end_clean(), ob_implicit_flush() and ob_gzhandler().
es: See also ob_get_contents(), ob_end_flush(), ob_end_clean(), and ob_implicit_flush()

source: OCIBindByName() binds the PHP variable variable to the Oracle placeholder ph_name.
es: OCIBindByName() enlaza la variable PHP variable a un placeholder de Oracle ph_name.

source: Whether it will be used for input or output will be determined run-time, and the necessary storage space will be allocated.
es: Si esta será usada para entrada o salida se determinará en tiempo de ejecución, y sera resevado el espacio necesario de almacenamiento.

source: The length The length parameter sets the maximum length for the bind.
es: El parámetro length establece el tamaño máximo del enlace.

source: If you set length to -1 OCIBindByName() will use the current length of variable to set the maximum length.
es: Si establece length a -1 OCIBindByName() usará el tamaño de la variable para establecer el tamaño máximo.

source: The length is not used for abstract Datatypes and should be set to -1.
es: Si necesita enlazar tipos de datos abstractos (LOB / ROWID / BFILE) necesitará primero reservar la memoria con la función OCINewDescriptor(). length no se usa para tipos de datos abstractos y debería establecerse a -1.

source: The type variable tells oracle, what kind of descriptor we want to use.
es: La variable type le informa a Oracle, que tipo de descriptor queremos usar.

source: Possible values are:
es: Los valores posibles son:

source: Oracle 8 functions
es: Funciones de Oracle 8

source: OCIColumnIsNULL() returns TRUE if the returned column column in the result from the statement stmt is NULL.
es: OCIColumnIsNULL() devuelve vedadero si la columna devuelta column en el resultset de la sentencia stmt es NULL.

source: You can either use the column-number (1-Based) or the column-name for the col parameter.
es: Puede usar el número de la columna (1-Based) o el nombre de la columa indicado por el parámetro col.

source: OCIColumnName() returns the name of the column corresponding to the column number (1-based) that is passed in.
es: OCIColumnName() Devuelve el nombre de la columna correspondiente al número de la columna (1-based) que es pasado.

source: ?php print "HTML PRE \n"; $conn = OCILogon("scott", "tiger"); $stmt = OCIParse($conn ,"select * from emp"); OCIExecute($stmt); print" TABLE BORDER=\"1\ ""; print "TR"; print "TH Name / TH"; print "TH Type / TH"; print "TH Length / TH"; print "/ TR"; $ncols = OCINumCols($stmt); for ($i = 1; $i = $ncols; $i+ +) {$column_name = OCIColumnName($stmt,$i); $column_type = OCIColumnType($stmt,$i); $column_size = OCIColumnSize($stmt,$i); print "TR"; print "TD $column_name / TD"; print "TD $column_type / TD"; print "TD $column_size / TD"; print "/ TR";} print "/ TABLE \n"; OCIFreeStatement($stmt); OCILogoff($conn); print" / PRE "; print" / HTML \n";?
es: ?php print "HTML PRE \n"; $conn = OCILogon("scott", "tiger"); $stmt = OCIParse($conn ,"select * from emp"); OCIExecute($stmt); print" TABLE BORDER=\"1\ ""; print "TR"; print "TH Name / TH"; print "TH Type / TH"; print "TH Length / TH"; print "/ TR"; $ncols = OCINumCols($stmt); for ($i = 1; $i = $ncols; $i+ +) {$column_name = OCIColumnName($stmt,$i); $column_type = OCIColumnType($stmt,$i); $column_size = OCIColumnSize($stmt,$i); print "TR"; print "TD $column_name / TD"; print "TD $column_type / TD"; print "TD $column_size / TD"; print "/ TR";} OCIFreeStatement($stmt); OCILogoff($conn); print "/ PRE"; print "/ HTML \n";?

source: See also OCINumCols(), OCIColumnType(), and OCIColumnSize().
es: Vea también OCINumCols(), OCIColumnType(), y OCIColumnSize().

source: See also OCINumCols(), OCIColumnName(), and OCIColumnSize().
es: Vea también OCINumCols(), OCIColumnName(), y OCIColumnSize().

source: OCIColumnType() returns the data type of the column corresponding to the column number (1-based) that is passed in.
es: OCIColumnType() devuelve el tipo de dato de una columna correspondiente al número de la columna (1-based) que es pasado.

source: Oracle reports: '. $error['message'];} / / Close connection OCILogoff($conn);?
es: OCICommit() confirma todas las sentencias pendientes para la conexión con Oracle connection.

source: OCIDefineByName() binds PHP variables for fetches of SQL-Columns.
es: OCIDefineByName() busca el valor de las Columnas-SQL dentro de variables PHP definidas por el usuario.

source: Be careful that Oracle uses ALL-UPPERCASE column-names, whereby in your select you can also write lowercase.
es: Cuidado que Oracle nombra todas las columnas en MAYUSCULAS, mientras que en su select puede usar también minúsculas write lower-case.

source: OCIDefineByName() expects the Column-Name to be in uppercase.
es: OCIDefineByName() espera que Column-Name esté en mayúsculas.

source: If you define a variable that doesn 't exists in you select statement, no error will be given!
es: Si define una variable que no existe en la sentecia SELECT, no se producirá ningún error.

source: If you need to define an abstract datatype (LOB / ROWID / BFILE) you need to allocate it first using OCINewDescriptor() function.
es: Si necesita definir un tipo de dato abstracto (LOB / ROWID / BFILE) tendrá que alojarlo primero usando la función OCINewDescriptor() function.

source: See also the OCIBindByName() function.
es: Vea también la función OCIBindByName().

source: ?php / * OCIDefineByName example - thies@thieso.net (980219) * / $conn = OCILogon("scott" ,"tiger"); $stmt = OCIParse($conn ,"select empno, ename from emp"); / * the define MUST be done BEFORE ociexecute! * / OCIDefineByName($stmt ,"EMPNO",$empno); OCIDefineByName($stmt ,"ENAME",$ename); OCIExecute($stmt); while (OCIFetch($stmt)) {echo "empno :".$empno ."\n"; echo "ename :".$ename ."\n";} OCIFreeStatement($stmt); OCILogoff($conn);?
es: ?php / * OCIDefineByPos example thies@digicol.de (980219) * / $conn = OCILogon("scott" ,"tiger"); $stmt = OCIParse($conn ,"select empno, ename from emp"); / * la definición DEBE hacerse ANTES del ociexecute! * / OCIDefineByName($stmt ,"EMPNO", $empno); OCIDefineByName($stmt ,"ENAME", $ename); OCIExecute($stmt); while (OCIFetch($stmt)) {echo "empno :".$empno ."\n"; echo "ename :".$ename ."\n";} OCIFreeStatement($stmt); OCILogoff($conn);?

source: OCIError() returns the last error found.
es: OCIError() devuelve el último error encontrado.

source: If the optional stmt_BAR_ conn _BAR_global is not provided, the last error encountered is returned.
es: Si el parámetro opcional stmt_BAR_ conn _BAR_global no es usado, es devuelto el último error encontrado.

source: If no error is found, OCIError() returns FALSE.
es: Si no se encuentra ningún error, OCIError() devuelve falso.

source: OCIError() returns the error as an associative array.
es: OCIError() devuelve el error como un array asociativo.

source: In this array, code consists the oracle error code and message the oracle errorstring.
es: En este array, code consiste en el código de error de Oracle y message en la cadena de descripción del error.

source: OCIExecute() executes a previously parsed statement. (see OCIParse()).
es: OCIExecute() ejecuta una sentencia previamente analizada. (see OCIParse()).

source: The optional mode allows you to specify the execution-mode (default is OCI_COMMIT_ON_SUCCESS).
es: El parámetro opcional mode le permite especificar el modo de ejecución (default is OCI_COMMIT_ON_SUCCESS).

source: OCIFetch() fetches the next row (for SELECT statements) into the internal result-buffer.
es: OCIFetch() Busca la siguiente fila (para sentencias SELECT) dentro del result-buffer interno.

source: OCIFetchInto() fetches the next row (for SELECT statements) into the result array.
es: OCIFetchInto() busca la siguiente fila (for SELECT statements) dentro del array result.

source: OCIFetchInto() will overwrite the previous content of result.
es: OCIFetchInto() sobreescribirá el contenido previo de result.

source: The mode parameter allows you to change the default behaviour.
es: Por defecto result contendrá un array basado en todas las columnas que no son NULL.

source: You can specify more than one flag by simply adding them up (eg OCI_ASSOC+OCI_RETURN_NULLS).
es: El parámetro mode le permite cambiar el comportamineto por defecto.

source: OCI_ASSOC Return an associative array.
es: Puede especificar más de una flag simplemente añadiendolas (ej.

source: OCI_NUM Return an numbered array starting with zero. (DEFAULT)
es: OCI_ASSOC+OCI_RETURN_NULLS).

source: OCI_RETURN_NULLS Return empty columns.
es: Las flags son:

source: OCI_RETURN_LOBS Return the value of a LOB instead of the descriptor.
es: OCI_ASSOC Devuelve un array asociativo.

source: A simple OCIFetchInto() example
es: OCI_NUM Devuelve un array numerado empezando en 1. (POR DEFECTO)

source: See also OCIFetch() and OCIExecute().
es: OCI_RETURN_LOBS Devuelve el valor de un LOB en vez de el descriptor.

source: OCIFetchStatement() fetches all the rows from a result into a user-defined array.
es: OCIFetchStatement() busca todas las filas de un resultset dentro de un array definido por el usuario.

source: OCIFetchStatement() returns the number of rows fetched.
es: OCIFetchStatement() devuelve el numero de filas buscadas.

source: OCIFreeCursor() returns TRUE if successful, or FALSE if unsuccessful.
es: OCIFreeCursor() devuelve cierto si la operacion se lleva a cabo, o falso en caso contrario.

source: OCIFreeStatement() returns TRUE if successful, or FALSE if unsuccessful.
es: OCIFreeStatement() devuelve cierto si la operacion se lleva a cabo, o falso en caso contrario.

source: OCIInternalDebug() enables internal debug output.
es: OCIInternalDebug() habilita la salida del depurador interno.

source: Set onoff to 0 to turn debug output off, 1 to turn it on.
es: Asigne 0 a onoff para deshabilitar la salida y 1 para habilitarla.

source: OCILogon() returns an connection identifier needed for most other OCI calls.
es: OCILogon() devuelve el identificador de conexión necesario en la mayoria de las funciones OCI.

source: The optional third parameter can either contain the name of the local Oracle instance or the name of the entry in tnsnames.ora to which you want to connect.
es: El tercer parámetro, que es opcional, puede contener el nombre de la instancia a Oracle o el nombre dado en el fichero tnsnames.ora de la base de datos a la que nos queremos conectar.

source: If the optional third parameter is not specified, PHP uses the environment variables ORACLE_SID (Oracle instance) or TWO_TASK (tnsnames.ora) to determine which database to connect to.
es: Si este parámetro no se especifica, PHP usa la variable de entorno ORACLE_SID (Oracle instance) o TWO_TASK (tnsnames.ora) para determinar la base de datos con la que queremos conectar.

source: Connections are shared at the page level when using OCILogon().
es: Las conexiones son compartidas a nivel de página cuando usemos OCILogon().

source: This means that commits and rollbacks apply to all open transactions in the page, even if you have created multiple connections.
es: Lo cual significa que los "commits" y "rollbacks "son aplicadas a todas las transacciones abiertas en la página, incluso si usted ha creado conexiones múltiples.

source: This example demonstrates how the connections are shared.
es: Este ejemplo demuestra como son compartidas las conexiones.

source: ?php print "HTML PRE"; $db = ""; $c1 = ocilogon("scott" ,"tiger",$db); $c2 = ocilogon("scott" ,"tiger",$db); function create_table($conn) {$stmt = ociparse($conn ,"create table scott.hallo (test varchar2(64))"); ociexecute($stmt); echo $conn. "created table\n\n";} function drop_table($conn) {$stmt = ociparse($conn ,"drop table scott.hallo"); ociexecute($stmt); echo $conn." dropped table\n\n";} function insert_data($conn) {$stmt = ociparse($conn ,"insert into scott.hallo values('$conn '_BAR_ _BAR_' '_BAR_ _BAR_ to_char(sysdate ,'DD-MON-YY HH24:MI:SS'))"); ociexecute($stmt,OCI_DEFAULT); echo $conn. "inserted hallo\n\n";} function delete_data($conn) {$stmt = ociparse($conn ,"delete from scott.hallo"); ociexecute($stmt,OCI_DEFAULT); echo $conn." deleted hallo\n\n";} function commit($conn) {ocicommit($conn); echo $conn. "committed\n\n";} function rollback($conn) {ocirollback($conn); echo $conn." rollback\n\n";} function select_data($conn) {$stmt = ociparse($conn ,"select * from scott.hallo"); ociexecute($stmt,OCI_DEFAULT); echo $conn ."----selecting\n\n"; while (ocifetch($stmt)) echo $conn. "".ociresult($stmt ,"TEST")." \n\n"; echo $conn ."----done\n\n";} create_table($c1); insert_data($c1); / / Insert a row using c1 insert_data($c2); / / Insert a row using c2 select_data($c1); / / Results of both inserts are returned select_data($c2); rollback($c1); / / Rollback using c1 select_data($c1); / / Both inserts have been rolled back select_data($c2); insert_data($c2); / / Insert a row using c2 commit($c2); / / commit using c2 select_data($c1); / / result of c2 insert is returned delete_data($c1); / / delete all rows in table using c1 select_data($c1); / / no rows returned select_data($c2); / / no rows returned commit($c1); / / commit using c1 select_data($c1); / / no rows returned select_data($c2); / / no rows returned drop_table($c1); print "/ PRE / HTML";?
es: ?php print "HTML PRE"; $db = ""; $c1 = ocilogon("scott" ,"tiger",$db); $c2 = ocilogon("scott" ,"tiger",$db); function create_table($conn) {$stmt = ociparse($conn ,"create table scott.hallo (test varchar2(64))"); ociexecute($stmt); echo $conn. "created table\n\n";} function drop_table($conn) {$stmt = ociparse($conn ,"drop table scott.hallo"); ociexecute($stmt); echo $conn." dropped table\n\n";} function insert_data($conn) {$stmt = ociparse($conn ,"insert into scott.hallo values('$conn '_BAR_ _BAR_' '_BAR_ _BAR_ to_char(sysdate ,'DD-MON-YY HH24:MI:SS'))"); ociexecute($stmt,OCI_DEFAULT); echo $conn. "inserted hallo\n\n";} function delete_data($conn) {$stmt = ociparse($conn ,"delete from scott.hallo"); ociexecute($stmt,OCI_DEFAULT); echo $conn." deleted hallo\n\n";} function commit($conn) {ocicommit($conn); echo $conn. "commited\n\n";} function rollback($conn) {ocirollback($conn); echo $conn." rollback\n\n";} function select_data($conn) {$stmt = ociparse($conn ,"select * from scott.hallo"); ociexecute($stmt,OCI_DEFAULT); echo $conn ."----selecting\n\n"; while (ocifetch($stmt)) echo $conn. "".ociresult($stmt ,"TEST")." \n\n"; echo $conn ."----done\n\n";} create_table($c1); insert_data($c1); / / Insert a row using c1 insert_data($c2); / / Insert a row using c2 select_data($c1); / / Results of both inserts are returned select_data($c2); rollback($c1); / / Rollback using c1 select_data($c1); / / Both inserts have been rolled back select_data($c2); insert_data($c2); / / Insert a row using c2 commit($c2); / / commit using c2 select_data($c1); / / result of c2 insert is returned delete_data($c1); / / delete all rows in table using c1 select_data($c1); / / no rows returned select_data($c2); / / no rows returned commit($c1); / / commit using c1 select_data($c1); / / no rows returned select_data($c2); / / no rows returned drop_table($c1); print "/ PRE / HTML";?

source: Using a REF CURSOR from a stored procedure
es: Usando un REF CURSOR de un procedimiento almacenado

source: ?php / / suppose your stored procedure info.output returns a ref cursor in :data $conn = OCILogon( "scott" ,"tiger"); $curs = OCINewCursor($conn); $stmt = OCIParse($conn ,"begin info.output(:data); end ;"); ocibindbyname($stmt ,"data", $curs,-1,OCI_B_CURSOR); ociexecute($stmt); ociexecute($curs); while (OCIFetchInto($curs, $data)) {var_dump($data);} OCIFreeStatement($stmt); OCIFreeCursor($curs); OCILogoff($conn);?
es: ?php / / suppose your stored procedure info.output returns a ref cursor in :data $conn = OCILogon( "scott" ,"tiger"); $curs = OCINewCursor($conn); $stmt = OCIParse($conn ,"begin info.output(:data); end ;"); ocibindbyname($stmt ,"data", $curs,-1,OCI_B_CURSOR); ociexecute($stmt); ociexecute($curs); while (OCIFetchInto($curs, $data)) {var_dump($data);} OCIFreeCursor($stmt); OCIFreeStatement($curs); OCILogoff($conn);?

source: Using a REF CURSOR in a select statement
es: Usando un REF CURSOR en una sentencia select

source: OCINewDescriptor() allocates storage to hold descriptors or LOB locators.
es: OCINewDescriptor() Reserva espacio para mantener descriptores o localizadores LOB.

source: Valid values for type are OCI_D_FILE, OCI_D_LOB, OCI_D_ROWID.
es: Los valores válidos para el tipo type son OCI_D_FILE, OCI_D_LOB, OCI_D_ROWID.

source: For LOB descriptors, the methods load, save, and savefile are associated with the descriptor, for BFILE only the load method exists.
es: Para descriptores LOB, los métodos load, save, y savefile están asociados con el descriptor, para BFILE sólo el método load existe.

source: See the second example usage hints.
es: Vea el segundo ejemplo.

source: OCINLogon() creates a new connection to an Oracle 8 database and logs on.
es: OCINLogon() crea una nueva conexión con una base de datos Oracle 8.

source: OCINLogon() forces a new connection.
es: OCINLogon() fuerza una nueva conexión.

source: This should be used if you need to isolate a set of transactions.
es: Se debe usar si necesita aislar un conjunto de transacciones.

source: By default, connections are shared at the page level if using OCILogon() or at the web server process level if using OCIPLogon().
es: Por defecto, las conexiones son compartidas a nivel de página si usa OCILogon() o a nivel del proceso del servidor web si usa OCIPLogon().

source: If you have multiple connections open using OCINLogon(), all commits and rollbacks apply to the specified connection only.
es: Si posee múltiples conexiones abiertas usando OCINLogon(), todos los "commits "y "rollbacks" se aplican sólo a la conexion especificada.

source: This example demonstrates how the connections are separated.
es: Este ejemplo demuestra como las conexiones están separadas.
